; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-72)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b1)
    (on b1 b15)
    (on b15 b18)
    (on b18 b16)
    (on b16 b4)
    (on b4 b12)
    (on b12 b14)
    (on b14 b10)
    (on b10 b9)
    (on b9 b19)
    (on b19 b5)
    (on b5 b2)
    (on b2 b20)
    (on b20 b3)
    (on-table b3)
    (clear b17)
    (on b17 b8)
    (on b8 b6)
    (on-table b6)
    (clear b7)
    (on b7 b21)
    (on b21 b13)
    (on-table b13))
 (:goal (and 
(on b13 b21)
))
)

; plan
1. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 0 of 1
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
3. (unstack b21 b13)
   deleted: (on b21 b13) (clear b21) (arm-empty)
   added: (holding b21) (clear b13)
   goals met: 0 of 1
4. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
5. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 0 of 1
6. (stack b13 b21)
   deleted: (clear b21) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b21)
   goals met: 1 of 1
